// Створіть програму, яка виводить на екран 10 випадкових чисел із діапазону -25…+25. Після кожного від’ємного числа потрібно виводити (впритул до числа) символ «?».

// Наприклад : 2, -8?,17,24,-17?,14

// Створити програму, яка виводить на екран двозначні додатні числа, які закінчуються на 7 ( в спадаючому порядку ). Перед початком вводу на екран потрібно вивести «початок», в після закінчення вводу  - «завершено».
// Приклад : початок, 97, … 17, завершено.


var m = -25;
var p = 25;
var arr = -26;
while(arr < p){
    document.write(arr + '?') 
    arr--;
    if(arr > 0){
        arr++;
        document.write(arr)
    }
}


var num = 1;
var n, t;
while(num <=300){
n = 0;
t = 1;
do {
    if (num % t == 0){
n++;
t++;
    }
}
while(t <= num){
if (n == 5){
    document.write(num + '<br>');
    num++;
}
}
}