//1. Напишіть функцію, яка приймає як аргумент відстань в кілометрах і повертає відстань в милях.
// Формула для перетворення : милі = кілометри * 0.6214.
let lenght = function ( a ) { 
        return a * 0.6214;
    }
const result = lenght( 6 ) 
console.log(result);



// 2. Напишіть функцію, яка виводить квадрат ( наприклад, із зірочок ), з розмірами, які залежать від глобальної змінної. Приклад для змінної з числом 4 : ( фото ).

let side = 4;
let str = '';
function draw_box(){
    for (let i = 1; i <= side; i++){
        for (let j = 1; j <= side; j++){
            str+= ' * ';
        }
        console.log(str);
        str = '';
    }
}
draw_box();
